students = {
    "Іваненко Іван Іванович": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 85, "Моделювання систем": 78}
    },
    "Петров Петро Петрович": {
        "Група": 102,
        "Курс": 3,
        "Оцінки": {"Програмування мовою Python": 90, "Моделювання систем": 82}
    },
    "Сидоренко Марія Олександрівна": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 88, "Моделювання систем": 76}
    },
    "Кумша Олег Васильович": {
        "Група": 103,
        "Курс": 1,
        "Оцінки": {"Програмування мовою Python": 80, "Моделювання систем": 85}
    },
    "Недозименко Андрій Павлович": {
        "Група": 102,
        "Курс": 3,
        "Оцінки": {"Програмування мовою Python": 86, "Моделювання систем": 80}
    },
    "Кирилко Володимир Вікторович": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 83, "Моделювання систем": 77}
    },
    "Бухтіяров Сергій Олександрович": {
        "Група": 103,
        "Курс": 1,
        "Оцінки": {"Програмування мовою Python": 81, "Моделювання систем": 79}
    },
    "Волок Дмитро Ігорович": {
        "Група": 101,
        "Курс": 2,
        "Оцінки": {"Програмування мовою Python": 87, "Моделювання систем": 81}
    }
}

# Виведення списку всіх студентів
def display_students():
    for name, info in students.items():
        print(f"{name} | Група {info['Група']} | Курс {info['Курс']} | Оцінки: {info['Оцінки']}")

# Додавання студента
def add_student(name, group, course, grades):
    students[name] = {"Група": group, "Курс": course, "Оцінки": grades}
    print(f"Додано студента {name}.")

# Видалення студента
def remove_student(pib):
    if pib in students:
        del students[pib]
        print(f"Студента {pib} успішно видалено.")
    else:
        print("Помилка: студент із таким ПІБ не знайдений.")

# Сортування студентів за номером групи
def sort_students_by_group():
    sorted_list = sorted(students.items(), key=lambda x: x[1]["Група"])
    for name, info in sorted_list:
        print(f"{name} | Група {info['Група']} | Курс {info['Курс']} | Оцінки: {info['Оцінки']}")

while True:
    print("\nМеню:")
    print("1 -> Вивести список студентів")
    print("2 -> Додати нового студента")
    print("3 -> Відсортувати студентів за групами")
    print("4 -> Видалити студента")
    print("5 -> Вийти")

    choice = input("Ваш вибір:\n")

    if choice == "1":
        display_students()
    elif choice == "2":
        add_student("Жуков Олексій Миколайович", 104, 1, {"Програмування мовою Python": 82, "Моделювання систем": 80})
    elif choice == "3":
        sort_students_by_group()
    elif choice == "4":
        pib = input("Введіть прізвище, ім'я та по батькові студента: ")
        remove_student(pib)
    elif choice == "5":
        print("Завершення програми.")
        break
    else:
        print("Помилка: введено некоректний варіант.")